# SQL review
---------------------
Custom database created with fictional or random data for a potential technology store based in Donostia/San Sebastián.

## Imports

In [8]:
import pandas as pd
import sqlite3

import prettytable
prettytable.DEFAULT = prettytable.TableStyle

%load_ext sql
%sql sqlite:///TechDonostia.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Read data to pandas

In [9]:
db_path = 'TechDonostia.db'
conn = sqlite3.connect(db_path)
query = 'SELECT * FROM proveedor'
df = pd.read_sql_query(query, conn)
conn.close()
print(df)

   proveedor_id            nombre                          email     telefono
0             1  TechDistribuidor  contacto@techdistribuidor.com  567-890-123
1             2      Gadgets S.A.             info@gadgetssa.com  678-901-234
2             3        ElectroHub          ventas@electrohub.com  890-234-567
3             4       MundoGadget       contacto@mundogadget.com  901-345-678

## Look into db

In [10]:
from sqlalchemy import create_engine, inspect

engine = create_engine('sqlite:///TechDonostia.db')
inspector = inspect(engine)
tables = inspector.get_table_names()

print("All tables:")
for table in tables:
    print(table)

All tables:
cliente
departamento
detalle_orden
empleado
equipo
orden
producto
proveedor
suministro

## SQL database queries

In [11]:
%sql PRAGMA table_info(empleado);

 * sqlite:///TechDonostia.db
Done.

[(0, 'empleado_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'VARCHAR', 0, None, 0),
 (2, 'email', 'VARCHAR', 0, None, 0),
 (3, 'telefono', 'VARCHAR', 0, None, 0),
 (4, 'salario', 'FLOAT', 0, None, 0),
 (5, 'fecha_ingreso', 'DATETIME', 0, None, 0),
 (6, 'departamento_id', 'INTEGER', 0, None, 0)]

In [12]:
%sql select nombre FROM empleado;

 * sqlite:///TechDonostia.db
Done.

[('Luis Martínez',),
 ('María Sánchez',),
 ('Javier Morales',),
 ('Sara Díaz',),
 ('Pedro Jiménez',),
 ('Elena Navarro',)]

In [13]:
%sql select nombre, telefono FROM empleado;

 * sqlite:///TechDonostia.db
Done.

[('Luis Martínez', '345-678-901'),
 ('María Sánchez', '456-789-012'),
 ('Javier Morales', '567-890-234'),
 ('Sara Díaz', '678-901-345'),
 ('Pedro Jiménez', '789-012-456'),
 ('Elena Navarro', '890-123-567')]

Tambien es posible solicitar todos los campos de una tabla con el signo asterisco(*):

In [14]:
%sql select * FROM empleado;

 * sqlite:///TechDonostia.db
Done.

[(1, 'Luis Martínez', 'luis.martinez@example.com', '345-678-901', 2000.0, '2019-05-17 00:00:00.000000', 1),
 (2, 'María Sánchez', 'maria.sanchez@example.com', '456-789-012', 2200.0, '2020-06-01 00:00:00.000000', 2),
 (3, 'Javier Morales', 'javier.morales@example.com', '567-890-234', 2500.0, '2018-04-10 00:00:00.000000', 3),
 (4, 'Sara Díaz', 'sara.diaz@example.com', '678-901-345', 2100.0, '2019-07-22 00:00:00.000000', 4),
 (5, 'Pedro Jiménez', 'pedro.jimenez@example.com', '789-012-456', 2300.0, '2021-03-15 00:00:00.000000', 5),
 (6, 'Elena Navarro', 'elena.navarro@example.com', '890-123-567', 2400.0, '2020-11-05 00:00:00.000000', 6)]

### 1: obtain a list of the names, phone numbers, and email addresses of all customers in order to contact them

In [15]:
%sql PRAGMA table_info(cliente);

 * sqlite:///TechDonostia.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'VARCHAR', 0, None, 0),
 (2, 'email', 'VARCHAR', 0, None, 0),
 (3, 'telefono', 'VARCHAR', 0, None, 0),
 (4, 'contacto', 'VARCHAR', 0, None, 0),
 (5, 'telefono_contacto', 'VARCHAR', 0, None, 0),
 (6, 'ciudad', 'VARCHAR', 0, None, 0)]

In [16]:
%sql select cliente.nombre, cliente.telefono, cliente.email from cliente

 * sqlite:///TechDonostia.db
Done.

[('Ana Pérez', '123-456-789', 'ana.perez@example.com'),
 ('Carlos García', '234-567-890', 'carlos.garcia@example.com'),
 ('Laura Fernández', '456-123-789', 'laura.fernandez@example.com'),
 ('Manuel López', '789-456-123', 'manuel.lopez@example.com'),
 ('Isabel Romero', '321-654-987', 'isabel.romero@example.com'),
 ('Fernando Castro', '234-567-890', 'fernando.castro@example.com'),
 ('Sonia Ruiz', '345-678-901', 'sonia.ruiz@example.com'),
 ('Daniel Gómez', '456-789-012', 'daniel.gomez@example.com'),
 ('Cristina Hernández', '567-890-123', 'cristina.hernandez@example.com'),
 ('Roberto Martínez', '678-901-234', 'roberto.martinez@example.com'),
 ('Patricia Jiménez', '789-012-345', 'patricia.jimenez@example.com'),
 ('Miguel Ángel López', '890-123-456', 'miguel.angel.lopez@example.com'),
 ('Beatriz Pérez', '901-234-567', 'beatriz.perez@example.com'),
 ('Jorge Torres', '012-345-678', 'jorge.torres@example.com'),
 ('Victor Ramos', '123-456-789', 'victor.ramos@example.com'),
 ('Ana Belén Ruiz', '234-567-890', 'ana.belen.ruiz@example.com'),
 ('Raquel Moreno', '345-678-901', 'raquel.moreno@example.com'),
 ('David Márquez', '456-789-012', 'david.marquez@example.com'),
 ('Elena Gil', '567-890-123', 'elena.gil@example.com'),
 ('Carlos Medina', '678-901-234', 'carlos.medina@example.com'),
 ('Silvia Navarro', '789-012-345', 'silvia.navarro@example.com'),
 ('Andrés Ortega', '890-123-456', 'andres.ortega@example.com'),
 ('Laura Fernández', '456-123-789', 'laura.fernandez@example.com'),
 ('Manuel López', '789-456-123', 'manuel.lopez@example.com'),
 ('Isabel Romero', '321-654-987', 'isabel.romero@example.com')]

### List the employees ordered by their salary (use or ORDER BY -ASC -DESC)

In [23]:
%sql select * from empleado

 * sqlite:///TechDonostia.db
Done.

[(1, 'Luis Martínez', 'luis.martinez@example.com', '345-678-901', 2000.0, '2019-05-17 00:00:00.000000', 1),
 (2, 'María Sánchez', 'maria.sanchez@example.com', '456-789-012', 2200.0, '2020-06-01 00:00:00.000000', 2),
 (3, 'Javier Morales', 'javier.morales@example.com', '567-890-234', 2500.0, '2018-04-10 00:00:00.000000', 3),
 (4, 'Sara Díaz', 'sara.diaz@example.com', '678-901-345', 2100.0, '2019-07-22 00:00:00.000000', 4),
 (5, 'Pedro Jiménez', 'pedro.jimenez@example.com', '789-012-456', 2300.0, '2021-03-15 00:00:00.000000', 5),
 (6, 'Elena Navarro', 'elena.navarro@example.com', '890-123-567', 2400.0, '2020-11-05 00:00:00.000000', 6),
 (7, 'Ana López', 'ana.lopez@example.com', '234-567-890', 2000.0, '2022-01-10', 3),
 (8, 'Carlos Ruiz', 'carlos.ruiz@example.com', '345-678-901', 2300.0, '2023-03-15', 2),
 (9, 'Sofía Pérez', 'sofia.perez@example.com', '456-789-012', 2400.0, '2021-07-22', 5),
 (10, 'David Gómez', 'david.gomez@example.com', '567-890-234', 2200.0, '2022-09-30', 1),
 (11, 'Laura Fernández', 'laura.fernandez@example.com', '678-901-345', 2100.0, '2023-11-05', 4)]

In [24]:
%sql select empleado.nombre, empleado.salario from empleado order by salario;

 * sqlite:///TechDonostia.db
Done.

[('Luis Martínez', 2000.0),
 ('Ana López', 2000.0),
 ('Sara Díaz', 2100.0),
 ('Laura Fernández', 2100.0),
 ('María Sánchez', 2200.0),
 ('David Gómez', 2200.0),
 ('Pedro Jiménez', 2300.0),
 ('Carlos Ruiz', 2300.0),
 ('Elena Navarro', 2400.0),
 ('Sofía Pérez', 2400.0),
 ('Javier Morales', 2500.0)]

In [25]:
%sql select nombre, salario FROM empleado ORDER BY salario DESC;

 * sqlite:///TechDonostia.db
Done.

[('Javier Morales', 2500.0),
 ('Elena Navarro', 2400.0),
 ('Sofía Pérez', 2400.0),
 ('Pedro Jiménez', 2300.0),
 ('Carlos Ruiz', 2300.0),
 ('María Sánchez', 2200.0),
 ('David Gómez', 2200.0),
 ('Sara Díaz', 2100.0),
 ('Laura Fernández', 2100.0),
 ('Luis Martínez', 2000.0),
 ('Ana López', 2000.0)]

Use LIMIT to cut the amount of data in the answer

In [26]:
%sql select nombre, salario FROM empleado ORDER BY salario DESC LIMIT 3;

 * sqlite:///TechDonostia.db
Done.

[('Javier Morales', 2500.0),
 ('Elena Navarro', 2400.0),
 ('Sofía Pérez', 2400.0)]

### DISTINCT removes duplicate fields from the results in a selection operation.

In [33]:
%sql select DISTINCT salario FROM empleado ORDER BY salario DESC;

 * sqlite:///TechDonostia.db
Done.

[(2500.0,), (2400.0,), (2300.0,), (2200.0,), (2100.0,), (2000.0,)]

### The **WHERE** Clause

It is used to limit the selection to fields that meet a specific condition.

```sql
SELECT field1, field2, ..., fieldN FROM Table WHERE condition;

Operators Used in the WHERE Clause
= : Equality
<> : Not equal
> : Greater than
< : Less than
>= : Greater than or equal to
<= : Less than or equal to
BETWEEN : Within a certain range
LIKE : Matches a given pattern
IN : Allows comparison against multiple values

In [34]:
%sql select nombre, salario FROM empleado WHERE salario>2200 ORDER BY salario DESC LIMIT 2;

 * sqlite:///TechDonostia.db
Done.

[('Javier Morales', 2500.0), ('Elena Navarro', 2400.0)]

In [35]:
%sql select nombre, salario FROM empleado WHERE salario = 2400;

 * sqlite:///TechDonostia.db
Done.

[('Elena Navarro', 2400.0), ('Sofía Pérez', 2400.0)]

In [36]:
%sql select nombre, salario FROM empleado WHERE ( salario >= 2100 AND salario <= 2300);

 * sqlite:///TechDonostia.db
Done.

[('María Sánchez', 2200.0),
 ('Sara Díaz', 2100.0),
 ('Pedro Jiménez', 2300.0),
 ('Carlos Ruiz', 2300.0),
 ('David Gómez', 2200.0),
 ('Laura Fernández', 2100.0)]

In [37]:
%sql select nombre, salario FROM empleado WHERE salario BETWEEN 2100 AND 2200;

 * sqlite:///TechDonostia.db
Done.

[('María Sánchez', 2200.0),
 ('Sara Díaz', 2100.0),
 ('David Gómez', 2200.0),
 ('Laura Fernández', 2100.0)]

In [38]:
%sql select nombre, salario FROM empleado WHERE salario IN (2100,2400);

 * sqlite:///TechDonostia.db
Done.

[('Sara Díaz', 2100.0),
 ('Elena Navarro', 2400.0),
 ('Sofía Pérez', 2400.0),
 ('Laura Fernández', 2100.0)]

### **Ejercicio 2**
----
Con el propósito actualizar la información de los clientes se quiere contactar a aquellos clientes que no tienen asociada una persona de contacto, para esto se pide que muestre de la tabla "cliente" los campos "nombre" y "telefono" de los clientes que no tienen un contacto registrado.

In [ ]:
%sql PRAGMA table_info(cliente)

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

In [ ]:
%sql select * from cliente

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

In [ ]:
%%sql
SELECT nombre,telefono

FROM cliente

WHERE contacto LIKE ''

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24')]

In [ ]:
%%sql
SELECT nombre,telefono

FROM cliente

WHERE LENGTH(contacto)=0

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Arnau Medina Garcia', '094-10-88'),
 ('Jan Vargas Santana', '780-65-24'),
 ('Pol Moya Pena', '780-25-24')]

### EL operador BETWEEN
Esta última instrucción puede escribirse de otra forma usando el operador **BETWEEN**, este operador es usado cuando queremos indicar que deseamos recuperar los registros según un intervalo de valores dado sobre un campo.

In [ ]:
%sql select nombre, salario FROM empleado WHERE salario Between 1400 AND 1600

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Andres Riera Herrera', 1500),
 ('Saul Moreno Santos', 1600),
 ('Isaac Jimenez Ortiz', 1600),
 ('Guillermo Vidal Gomez', 1400),
 ('Daniel Quintero Quintero', 1500),
 ('Juan Manuel Olivares', 1500)]

### EL operador LIKE
Este operador es usado cuando se filtra la consulta con algún modelo o patrón sobre una columna.
Este operador se combina con simbolos "%" y "_":
* % Representa cero o mas caracteres a ser reemplazados en el patron por otros.
* _ Representa un único caracter.

Veamos algúnos ejemplos:

In [ ]:
%sql select * FROM cliente WHERE nombre LIKE "%Garcia%";

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid')]

La instrucción anterior busca todos los clientes cuyo nombre contiene la secuencia de caracteres "Medina" en alguna posición.

In [ ]:
%sql select * FROM cliente WHERE email LIKE "%@gmail.com";

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

EL comando anterior busca los clientes que tienen un correo que termine en "@gmail.com".

**Veamos a consultar todos los clientes cuyo número telefónico comience por "780"**

In [ ]:
%sql select * FROM cliente WHERE telefono LIKE "780-%";

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo')]

### **Ejercicio 3**
--------
Un empleado de la empresa Love4Pets se dió cuenta que un cliente dejó por accidente su celular, el empleado recuerda que alguno de sus apellidos era "Leon".

Se quiere que determinar a quien pertenece el celular extraviado, y en caso de ser posible avisar a su persona de contacto que el celular está a salvo y pueden pasar buscandolo en cualquier momento.
   
Se sabe que la tabla **"cliente"** tiene un campo **"nombre"** el cual contiene nombres y apellidos, el campo **"contacto"** que tiene el nombre de la persona de contacto y el campo **"telefono_contacto"** que tiene el telefono de la persona de contacto.

In [ ]:
%sql PRAGMA table_info(cliente)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'cliente_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'email', 'TEXT', 0, None, 0),
 (3, 'telefono', 'TEXT', 1, None, 0),
 (4, 'contacto', 'TEXT', 0, None, 0),
 (5, 'telefono_contacto', 'TEXT', 0, None, 0),
 (6, 'ciudad', 'TEXT', 1, None, 0)]

In [ ]:
%%sql
SELECT nombre, contacto,telefono_contacto

FROM cliente

WHERE nombre LIKE '%LEON%'

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Rayan Leon Ferrer', 'Santiago Perez Ramos', '577-21-24')]

### Operadores AND, OR, NOT
Estos operadores son usados para filtrar resultados según mas de una condición.

**Operador AND:** Se muestran los resultados que cumplen las condiciones separadas por el operador AND, es decir el resultado de la operación AND tiene valor TRUE

Sintaxis del Operador AND
```sql
select campo FROM Tabla WHERE condicion1 AND condicion2;
```

**Operador OR:** Se muestran los resultados que cumplen alguna de las condiciones separadas por el operador OR, es decir el resultado de la operación OR tiene valor TRUE

Sintaxis del Operador OR
```sql
select campo FROM Tabla WHERE condicion1 OR condicion2;
```

**Operador NOT:** Se muestran los resultados que NO cumplen con la condicion indicada.

Sintaxis del Operador NOT
```sql
select campo FROM Tabla WHERE NOT condicion1;
```

In [ ]:
%sql select * FROM empleado WHERE (salario >= 1500 AND departamento_id = 6)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]

En el ejemplo anterior la consulta muestra los empleados que tienen un salario mayor o igual a 1500 y que trabajan en el departamento de informática el cual tiene código 6.

Veamos como podemos usar **consultas anidadas** para buscar la misma consulta colocando el nombre del departamento en lugar del código.

In [ ]:
%%sql
select * FROM empleado
WHERE
( salario >= 1500 AND departamento_id = (select departamento_id FROM departamento WHERE nombre="informatica" ) )

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]

Veamos un ejemplo donde consultamos las mascotas asociadas a una persona con nombre "Arnau Medina Garcia"

In [ ]:
%%sql
select * FROM mascota WHERE  cliente_id=( select cliente_id FROM cliente WHERE nombre="Arnau Medina Garcia" )

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Luna', 2, 'gato', 'mestizo', '2009-01-01 00:00:000')]

Ejemplo con Operador **OR**

In [ ]:
%%sql
select nombre, departamento_id from empleado where (empleado.departamento_id = 1) OR (empleado.departamento_id = 3)

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Pablo Pons Sanz', 1),
 ('Saul Moreno Santos', 1),
 ('Isaac Jimenez Ortiz', 3),
 ('Guillermo Vidal Gomez', 3)]

En la consulta anterior se muestran los empleados que trabajan en el departamento de Finanzas o en el departamento de Recursos Humanos

Ejemplo con el operador **NOT**

Veamos el complemento de la consulta anterior.

In [ ]:
%%sql
select nombre, departamento_id from empleado
where
NOT ((empleado.departamento_id = 1) OR (empleado.departamento_id = 3))

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera', 6),
 ('Lucas Serrano Caballero', 2),
 ('Nil Soler Diez', 5),
 ('Sergio Reyes Gallardo', 5),
 ('Daniel Quintero Quintero', 6),
 ('Miguel Soto', 6),
 ('Alejandro Fernandez', 6)]

### **Ejercicio 4**
--------
La empresa Love4Pets considera hacer un descuento sobre los productos que cuestan entre 10 y 20 euros, y complementos vitamínicos.
      
Se requiere que liste las columnas "nombre", "descripcion", "precio" de productos a los que debe ser aplicado el descuento. ( asuma que los productos se encuentran en la tabla "producto" )
   
Asuma que el producto vitaminico no lleva acentos, generalmente estos productos tienen la palabra vitamina en la **"descripcion"** pero podria ser alguna variante como vitaminico o comenzar por mayusculas, el departamento de informática recomendó usar la función Like para esta busqueda.

In [ ]:
%sql select * from producto

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Champu Mimadito', 'Champu neutro para mascotas', 7),
 (2, 'Vitaminas', 'Complemento vitaminico', 5),
 (3, 'Antipulgas', 'Liquido antipulgas', 3),
 (4, 'Perrarina', 'Huesos', 12),
 (5, 'Gatarina', 'Catspettito', 13),
 (6, 'Peine N7', 'Peine para perros numero 7', 3),
 (7, 'peluqueria', 'Corte de cabello para perros', 3),
 (8, 'Consulta', 'Consulta veterinaria', 15)]

In [ ]:
%sql PRAGMA table_info(producto)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'producto_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0),
 (2, 'descripcion', 'TEXT', 1, None, 0),
 (3, 'precio', 'INTEGER', 1, None, 0)]

In [ ]:
%%sql
SELECT nombre, descripcion, precio

FROM producto

WHERE (precio BETWEEN 10 AND 20) OR (lower(descripcion) LIKE '%com%vitam%')

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Vitaminas', 'Complemento vitaminico', 5),
 ('Perrarina', 'Huesos', 12),
 ('Gatarina', 'Catspettito', 13),
 ('Consulta', 'Consulta veterinaria', 15)]

### Funciones MAX() y MIN()
Con frecuencia tenemos una lista de valores y queremos obtener el mayor o el menor, esto es lo que hacen las funciones Max y Min.

Sintaxis de la función MIN
```sql
SELECT MIN(column_name)
FROM table_name
WHERE condition;
```

Sintaxis de la función MAX
```sql
SELECT MAX(column_name)
FROM table_name
WHERE condition;
```
Veamos un ejemplo:

In [ ]:
%sql select MIN(precio),nombre from producto;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(3, 'Antipulgas')]

In [ ]:
%sql select MAX(precio) from producto;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(15,)]

### **Ejercicio 5**
--------
La empresa Love4Pets esta considerando realizar un aumento.
    
Se requiere que indique cual es el menor sueldo que está pagando la empresa.

In [ ]:
%sql select * from empleado

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Andres Riera Herrera', 'andresr@gmail.com', '200-88-76', 1500, '2017-05-17 00:00:000', 6),
 (2, 'Lucas Serrano Caballero', 'lucas99@gmail.com', '115-24-36', 1200, '2018-05-17 00:00:000', 2),
 (3, 'Pablo Pons Sanz', 'ppsanz@gmail.com', '748-72-75', 1350, '2016-07-01 00:00:000', 1),
 (4, 'Saul Moreno Santos', 'saul.morenosantos@gmail.com', '346-87-27', 1600, '2016-07-01 00:00:000', 1),
 (5, 'Nil Soler Diez', 'nilsoler@gmail.com', '576-84-28', 1100, '2016-04-03 00:00:000', 5),
 (6, 'Sergio Reyes Gallardo', 'zerg@gmail.com', '598-95-67', 1000, '2016-04-03 00:00:000', 5),
 (7, 'Isaac Jimenez Ortiz', 'isaacortiz@gmail.com', '370-19-65', 1600, '2016-07-08 00:00:000', 3),
 (8, 'Guillermo Vidal Gomez', 'guillevidal@gmail.com', '099-05-68', 1400, '2016-01-03 00:00:000', 3),
 (9, 'Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06', 1500, '2017-03-05 00:00:000', 6),
 (10, 'Juan Manuel Olivares', 'juanma@gmail.com', '269-37-06', 1500, '2017-03-05 00:00:000', None),
 (11, 'Miguel Soto', 'misoto@gmail.com', '269-92-06', 1900, '2017-03-05 00:00:000', 6),
 (12, 'Alejandro Fernandez', 'alefer@gmail.com', '119-91-16', 1850, '2017-03-05 00:00:000', 6)]

In [ ]:
%sql select MIN(salario) from empleado

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1000,)]

### Funciones COUNT(), AVG(), SUM()
Nos permite contar la cantidad de resultados que arroja una consulta, obtener un valor promedio, o sumar los valores de una consulta.

**Función count** Retorna la cantidad de filas que arroja una consulta.

Sintaxis de la función COUNT
```sql
SELECT COUNT(column_name)
FROM table_name
WHERE condition;
```

**Función AVG** Retorna la el promedio de los valores de las filas que arroja una consulta.

Sintaxis de la función COUNT
```sql
SELECT AVG(column_name)
FROM table_name
WHERE condition;
```

**Función SUM** Retorna la el promedio de los valores de las filas que arroja una consulta.

Sintaxis de la función COUNT
```sql
SELECT SUM(column_name)
FROM table_name
WHERE condition;
```

In [ ]:
%sql select COUNT(salario) from empleado;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(12,)]

### **Ejercicio 6**
--------
La empresa Love4Pets continúa estudiando un ajuste en los salarios de los empleados, por lo que se quiere conocer el presupuesto total requerido para el pago de los salarios en un año.

In [ ]:
%%sql
SELECT SUM(salario)*12
FROM empleado

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(210000,)]

### El Operador IN
Permite especificar multiples valores a la clausula WHERE

Sintaxis del operador IN
```sql
SELECT column_name(s)
FROM table_name
WHERE column_name IN (value1, value2, ...);
```
Veamos un ejemplo

In [ ]:
%sql select nombre, ciudad from cliente where ciudad IN ("Madrid", "Toledo");

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Mario Flores Gallardo', 'Madrid'),
 ('Arnau Medina Garcia', 'Madrid'),
 ('Ivan Medina Rubio', 'Toledo'),
 ('Jan Vargas Santana', 'Madrid'),
 ('Carlos Costa Guerrero', 'Madrid'),
 ('Roberto Martin Ortega', 'Madrid'),
 ('Gabriel Gonzalez Ortega', 'Madrid'),
 ('Rayan Leon Ferrer', 'Madrid'),
 ('Aitor Ruiz Sanchez', 'Madrid'),
 ('Eric Rubio Carrasco', 'Madrid'),
 ('Alberto Sanz Ruiz', 'Madrid'),
 ('Jesus Medina Hernandez', 'Madrid'),
 ('Pol Moya Pena', 'Toledo'),
 ('Jose Gallardo Rodriguez', 'Madrid'),
 ('Manuel Angel Gil', 'Madrid')]

### Clausula JOIN

Hasta ahora hemos realizado consultas muy sencillas casi todas sobre una sola tabla, sin aprovechar las relaciones que existen entre las tablas.

Algunas de las tablas en Love4Pets están relacionadas  por medio de claves foraneas, por ejemplo la tabla empleado tiene un campo departamento_id que almacena el código del departamento donde trabaja un empleado, por medio de está relación podemos consultar también el nombre del departamento, esta consulta puede hacerse haciendo consultas anidadas, pero también usando la clausula **JOIN**

La clausula JOIN es usada para combinar columnas de una o mas tablas por medio de campos que relacionan estas tablas.

Existen diferentes tipos de JOIN.

#### **Inner JOIN**
Retorna los valores cumplen la relación entre ambas tablas, es decir las filas de una tabla que estan relacionadas con filas de otra tabla por medio de claves foraneas. El INNER JOIN también es llamado simplemente JOIN.

Sintaxis del Inner Join

```sql
select campo1, campo2, campoN FROM tabla1 INNER JOIN tabla2 ON tabla1.campo = tabla2.campo;
```

Veamos un ejemplo:  
Primero veamos la siguiente consulta

In [ ]:
%%sql
SELECT empleado.nombre, departamento.nombre

FROM empleado, departamento

WHERE empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Andres Riera Herrera', 'informatica'),
 ('Lucas Serrano Caballero', 'ventas'),
 ('Pablo Pons Sanz', 'finanzas'),
 ('Saul Moreno Santos', 'finanzas'),
 ('Nil Soler Diez', 'veterinario'),
 ('Sergio Reyes Gallardo', 'veterinario'),
 ('Isaac Jimenez Ortiz', 'recursos humanos'),
 ('Guillermo Vidal Gomez', 'recursos humanos'),
 ('Daniel Quintero Quintero', 'informatica'),
 ('Miguel Soto', 'informatica'),
 ('Alejandro Fernandez', 'informatica')]

Se muestran todos los empleados que trabajan en algun departamento, en esta consulta se excluyen empleados que no trabajan en ningun departamento y departamentos que no tienen ningun empleado.

Veamos ahora la siguiente consulta

In [ ]:
%%sql
select empleado.nombre AS 'NombreEmp', departamento.nombre 'NombreDep'

from empleado INNER JOIN departamento ON empleado.departamento_id = departamento.departamento_id

WHERE empleado.salario > 1800

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Miguel Soto', 'informatica'), ('Alejandro Fernandez', 'informatica')]

Esta instrucción realiza la misma consulta que el comando anterior, es decir muestra los empleados que trabajan en algun departamento

#### **Left JOIN**
Retorna los registros de la tabla "izquierda" o la primera tabla, y los registros que coinciden con la segunda tabla, excluyendo los registros que se encuentren en la segunda tabla pero que no hagan match con la primera.
![Texto alternativo](https://raw.githubusercontent.com/dasesu/practicasql/master/imagenes/left%20join.png)

Sintaxis del LEFT JOIN
```sql
select campo1, campo2, campoN FROM tabla1 LEFT JOIN tabla2 ON tabla1.campo = tabla2.campo;
```

Veamos un ejemplo:

In [ ]:
%%sql
select empleado.nombre, departamento.nombre from empleado
LEFT JOIN
departamento ON empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Andres Riera Herrera', 'informatica'),
 ('Lucas Serrano Caballero', 'ventas'),
 ('Pablo Pons Sanz', 'finanzas'),
 ('Saul Moreno Santos', 'finanzas'),
 ('Nil Soler Diez', 'veterinario'),
 ('Sergio Reyes Gallardo', 'veterinario'),
 ('Isaac Jimenez Ortiz', 'recursos humanos'),
 ('Guillermo Vidal Gomez', 'recursos humanos'),
 ('Daniel Quintero Quintero', 'informatica'),
 ('Juan Manuel Olivares', None),
 ('Miguel Soto', 'informatica'),
 ('Alejandro Fernandez', 'informatica')]

En el resultado anterior observe que el empleado "Juan Manuel Olivares" no está asociado a ningun departamento, sin embargo este es mostrado porque forma parte de la tabla1, pero no en la tabla2

#### **Right JOIN**
Retorna los registros de la tabla "derecha" o la segunda tabla, y los registros que coinciden con la primera tabla, excluyendo los registros que se encuentren en la primera tabla pero que no hagan match con la segunda.

Sintaxis del RIGHT JOIN
```sql
select campo1, campo2, campoN FROM tabla1 RIGHT JOIN tabla2 ON tabla1.campo = tabla2.campo;
```

**Esta instrucción no es reconocida por Sqlite3, por lo que al tratar de ejecutar esta sentencia se obtendrá un error.**

Sin embargo esta instrucción puede construirse usando un LEFT JOIN invirtiendo el orden de las tablas.

Veamos un ejemplo. ( El siguiente es un error provocado de forma intencional )

In [ ]:
%%sql
select empleado.nombre, departamento.nombre from empleado
RIGHT JOIN
departamento ON empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: select empleado.nombre, departamento.nombre from empleado
RIGHT JOIN
departamento ON empleado.departamento_id = departamento.departamento_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

El siguiente código arroja el mismo resultado que debería arrojar el RIGHT JOIN, haciendo uso del LEFT JOIN, invirtiendo las la posición de las tablas

In [ ]:
%%sql
select departamento.nombre, empleado.nombre from departamento
LEFT JOIN
empleado ON empleado.departamento_id = departamento.departamento_id;

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('finanzas', 'Pablo Pons Sanz'),
 ('finanzas', 'Saul Moreno Santos'),
 ('ventas', 'Lucas Serrano Caballero'),
 ('recursos humanos', 'Guillermo Vidal Gomez'),
 ('recursos humanos', 'Isaac Jimenez Ortiz'),
 ('marketing', None),
 ('veterinario', 'Nil Soler Diez'),
 ('veterinario', 'Sergio Reyes Gallardo'),
 ('informatica', 'Alejandro Fernandez'),
 ('informatica', 'Andres Riera Herrera'),
 ('informatica', 'Daniel Quintero Quintero'),
 ('informatica', 'Miguel Soto'),
 ('investigacion', None)]

### **Ejercicio 7**
--------
 Considerando la tabla "cliente" y la tabla "mascota" las cuales tienen una relación uno a muchos.  
 Indique los clientes que no tienen mascota registrada.

In [ ]:
%sql select * from cliente

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

In [ ]:
%sql select * from mascota

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Luna', 2, 'gato', 'mestizo', '2009-01-01 00:00:000'),
 (2, 'Sole', 3, 'gato', 'mestizo', '2010-02-01 00:00:000'),
 (3, 'Mida', 3, 'perro', 'Caint terrier', '2007-02-03 00:00:000'),
 (4, 'Tara', 5, 'perro', 'Puddle', '2006-02-03 00:00:000'),
 (5, 'Pelusa', 6, 'perro', 'Puddle', '2008-02-03 00:00:000'),
 (6, 'irene', 7, 'gato', 'siames', '2015-02-03 00:00:000'),
 (7, 'sara', 8, 'gato', 'mestizo', '2016-05-01 00:00:000'),
 (8, 'milo', 11, 'gato', 'mestizo', '2016-09-01 00:00:000'),
 (9, 'oliver', 11, 'gato', 'mestizo', '2016-07-07 00:00:000'),
 (10, 'Duke', 14, 'perro', 'Pastor Aleman', '2011-05-03 00:00:000')]

In [ ]:
%%sql
SELECT cliente.cliente_id, cliente.nombre

FROM cliente

WHERE cliente.cliente_id NOT IN (SELECT cliente_id FROM mascota)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo'),
 (4, 'Jan Vargas Santana'),
 (9, 'Aitor Ruiz Sanchez'),
 (10, 'Eric Rubio Carrasco'),
 (12, 'Jesus Medina Hernandez'),
 (13, 'Pol Moya Pena'),
 (15, 'Manuel Angel Gil')]

In [ ]:
%%sql
SELECT cliente.cliente_id, cliente.nombre, mascota.mascota_id

FROM cliente LEFT JOIN mascota ON cliente.cliente_id = mascota.cliente_id

WHERE mascota.mascota_id IS NULL

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', None),
 (4, 'Jan Vargas Santana', None),
 (9, 'Aitor Ruiz Sanchez', None),
 (10, 'Eric Rubio Carrasco', None),
 (12, 'Jesus Medina Hernandez', None),
 (13, 'Pol Moya Pena', None),
 (15, 'Manuel Angel Gil', None)]

### Operador UNION
Es usado para combinar resultados de varias consultas en una sola vista.
* Cada Instrucción SELECT involucrada en la operación UNION tiene que tener la misma cantidad de columnas.
* Las columnas ademas tienen que tener los mismos tipos de datos.

**Sintaxis de la Operación UNION**
```sql
SELECT column_name(s) FROM table1
UNION
SELECT column_name(s) FROM table2;
```

In [ ]:
%%sql
select nombre,email,telefono from empleado
UNION
select nombre,email,telefono from cliente

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[('Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24'),
 ('Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24'),
 ('Alejandro Fernandez', 'alefer@gmail.com', '119-91-16'),
 ('Andres Riera Herrera', 'andresr@gmail.com', '200-88-76'),
 ('Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88'),
 ('Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24'),
 ('Daniel Quintero Quintero', 'danielquinterox2@gmail.com', '261-97-06'),
 ('Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79'),
 ('Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14'),
 ('Guillermo Vidal Gomez', 'guillevidal@gmail.com', '099-05-68'),
 ('Isaac Jimenez Ortiz', 'isaacortiz@gmail.com', '370-19-65'),
 ('Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72'),
 ('Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24'),
 ('Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25'),
 ('Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11'),
 ('Juan Manuel Olivares', 'juanma@gmail.com', '269-37-06'),
 ('Lucas Serrano Caballero', 'lucas99@gmail.com', '115-24-36'),
 ('Manuel Angel Gil', 'manano@gmail.com', '733-65-16'),
 ('Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36'),
 ('Miguel Soto', 'misoto@gmail.com', '269-92-06'),
 ('Nil Soler Diez', 'nilsoler@gmail.com', '576-84-28'),
 ('Pablo Pons Sanz', 'ppsanz@gmail.com', '748-72-75'),
 ('Pol Moya Pena', 'polmoya@gmail.com', '780-25-24'),
 ('Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24'),
 ('Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27'),
 ('Saul Moreno Santos', 'saul.morenosantos@gmail.com', '346-87-27'),
 ('Sergio Reyes Gallardo', 'zerg@gmail.com', '598-95-67')]

### La Instrucción GROUP BY
Permite agrupar valores por un valor común a ellos

Sintaxis de la instrucción GROUP BY
```sql
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
```

Veamos un ejemplo contamos la cantidad de clientes que habitan en cada ciudad.

In [ ]:
%%sql
select COUNT(nombre),ciudad from cliente
GROUP BY ciudad

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(13, 'Madrid'), (2, 'Toledo')]

### **Ejercicio 8**
--------
No todas las personas tienen la misma cantidad de mascotas. Se requiere que usted indique el cliente y cantidad de mascotas que tiene cada cliente que tenga mascotas.

In [ ]:
%sql select * from cliente

 * sqlite:////content/drive/MyDrive/Data_Valencia/love4pets.db
Done.

[(1, 'Mario Flores Gallardo', 'marioflores@gmail.com', '036-15-36', 'Aintzane Alvarez Iglesias', '210-35-57', 'Madrid'),
 (2, 'Arnau Medina Garcia', 'arnaumedina@gmail.com', '094-10-88', '', '', 'Madrid'),
 (3, 'Ivan Medina Rubio', 'ivanmedina@gmail.com', '083-08-72', 'Javier Domenech', '488-48-46', 'Toledo'),
 (4, 'Jan Vargas Santana', 'vargasjan@gmail.com', '780-65-24', '', '', 'Madrid'),
 (5, 'Carlos Costa Guerrero', 'carloscostag@gmail.com', '180-65-24', 'Cristian Jimenez', '801-28-09', 'Madrid'),
 (6, 'Roberto Martin Ortega', 'robertmartin@gmail.com', '742-63-27', 'Jorge Vila Gallardo', '564-52-13', 'Madrid'),
 (7, 'Gabriel Gonzalez Ortega', 'gabogonzo@gmail.com', '780-13-14', 'Miguel Bosch Parra', '882-17-20', 'Madrid'),
 (8, 'Rayan Leon Ferrer', 'rayito@gmail.com', '430-65-24', 'Santiago Perez Ramos', '577-21-24', 'Madrid'),
 (9, 'Aitor Ruiz Sanchez', 'aitorsanchez@gmail.com', '780-77-24', 'Gabriel Gonzalez Ortega', '784-96-31', 'Madrid'),
 (10, 'Eric Rubio Carrasco', 'ericrubio@gmail.com', '780-65-79', 'Cristian Jimenez Martinez', '147-01-12', 'Madrid'),
 (11, 'Alberto Sanz Ruiz', 'albert@gmail.com', '781-15-24', 'Gabriel Gonzalez Ortega', '028-51-21', 'Madrid'),
 (12, 'Jesus Medina Hernandez', 'jmedinah@gmail.com', '782-35-25', 'Vctor Gonzalez Castillo', '661-85-12', 'Madrid'),
 (13, 'Pol Moya Pena', 'polmoya@gmail.com', '780-25-24', '', '', 'Toledo'),
 (14, 'Jose Gallardo Rodriguez', 'josegallardo@gmail.com', '783-65-11', 'Hector Martin Morales', '867-97-99', 'Madrid'),
 (15, 'Manuel Angel Gil', 'manano@gmail.com', '733-65-16', 'Hector Navarro', '067-97-91', 'Madrid')]

In [ ]:
%sql select * from mascota

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'Luna', 2, 'gato', 'mestizo', '2009-01-01 00:00:000'),
 (2, 'Sole', 3, 'gato', 'mestizo', '2010-02-01 00:00:000'),
 (3, 'Mida', 3, 'perro', 'Caint terrier', '2007-02-03 00:00:000'),
 (4, 'Tara', 5, 'perro', 'Puddle', '2006-02-03 00:00:000'),
 (5, 'Pelusa', 6, 'perro', 'Puddle', '2008-02-03 00:00:000'),
 (6, 'irene', 7, 'gato', 'siames', '2015-02-03 00:00:000'),
 (7, 'sara', 8, 'gato', 'mestizo', '2016-05-01 00:00:000'),
 (8, 'milo', 11, 'gato', 'mestizo', '2016-09-01 00:00:000'),
 (9, 'oliver', 11, 'gato', 'mestizo', '2016-07-07 00:00:000'),
 (10, 'Duke', 14, 'perro', 'Pastor Aleman', '2011-05-03 00:00:000')]

In [ ]:
%%sql
SELECT cliente.nombre, COUNT(cliente.nombre) AS 'Cantidad Mascotas'

FROM cliente INNER JOIN mascota ON cliente.cliente_id = mascota.cliente_id

GROUP BY mascota.cliente_id

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Arnau Medina Garcia', 1),
 ('Ivan Medina Rubio', 2),
 ('Carlos Costa Guerrero', 1),
 ('Roberto Martin Ortega', 1),
 ('Gabriel Gonzalez Ortega', 1),
 ('Rayan Leon Ferrer', 1),
 ('Alberto Sanz Ruiz', 2),
 ('Jose Gallardo Rodriguez', 1)]

### La Instrucción HAVING
Permite filtrar una busqueda donde se aplica una función de agregación sobre la condición.

Sintaxis de la instrucción GROUP BY
```sql
SELECT column_name(s)
FROM table_name
WHERE condition
HAVING column_name(s)
```

Tomando el mismo ejemplo anterior queremos mostrar las ciudades que tengan mas de 5 clientes.

In [ ]:
%%sql
select COUNT(nombre),ciudad from cliente
GROUP BY ciudad HAVING COUNT(nombre) > 1;

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(13, 'Madrid'), (2, 'Toledo')]

### **Ejercicio 9**
--------
Se requiere que usted indique los clientes que tienen mas de una mascota.

In [ ]:
%%sql
SELECT cliente.nombre, COUNT(cliente.nombre) AS 'Cantidad Mascotas'

FROM cliente INNER JOIN mascota ON cliente.cliente_id = mascota.cliente_id

GROUP BY mascota.cliente_id HAVING COUNT(cliente.nombre) > 1

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[('Ivan Medina Rubio', 2), ('Alberto Sanz Ruiz', 2)]

### La Instrucción INSERT
La instrucción insert permite agregar nuevos valores a las tablas

```sql
INSERT INTO table_name (columna1, columna2, columna3, ...)
VALUES (valor1, valor2, valor3, ...);
```

donde el valor1 es insertado en la columna1, el valor2 en la columna2 y asi sucesivamente.

In [ ]:
%sql PRAGMA table_info(departamento)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(0, 'departamento_id', 'INTEGER', 1, None, 1),
 (1, 'nombre', 'TEXT', 1, None, 0)]

In [ ]:
%sql select * from departamento

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'veterinario'),
 (6, 'informatica'),
 (7, 'investigacion'),
 (8, 'ciber')]

In [ ]:
%%sql
INSERT INTO departamento (departamento_id,nombre)
VALUES (9,898)

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
1 rows affected.

[]

In [ ]:
%sql select * from departamento

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'veterinario'),
 (6, 'informatica'),
 (7, 'investigacion'),
 (8, 'ciber'),
 (9, '898')]

### La Instrucción DELETE
La instrucción DELETE permite ELIMINAR filas que cumplan con una determinada condición

```sql
DELETE FROM table_name
WHERE condition;
```

In [ ]:
%sql delete from departamento where nombre='898';

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
1 rows affected.

[]

## UPDATE

In [ ]:
%%sql
UPDATE departamento
SET nombre = 'vet'
WHERE nombre LIKE "%veterinario%"

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
1 rows affected.

[]

In [ ]:
%sql SELECT * from departamento

 * sqlite:////content/drive/MyDrive/Telmo/love4pets.db
Done.

[(1, 'finanzas'),
 (2, 'ventas'),
 (3, 'recursos humanos'),
 (4, 'marketing'),
 (5, 'vet'),
 (6, 'informatica'),
 (7, 'investigacion')]